#### Connection to mysql

In [1]:
%load_ext sql

In [2]:
%%sql
mysql+pymysql://w-alkao:mypassword@localhost

In [3]:
%sql SHOW DATABASES;

 * mysql+pymysql://w-alkao:***@localhost
8 rows affected.

[('ap',),
 ('ex',),
 ('information_schema',),
 ('livestock',),
 ('mysql',),
 ('om',),
 ('performance_schema',),
 ('sys',)]

In [4]:
%sql USE ap;

 * mysql+pymysql://w-alkao:***@localhost
0 rows affected.

[]

#### 1- Aggregate function

In [11]:
%%sql # Query that counts unpaid invoices and calculates the total due

SELECT COUNT(*) AS number_of_invoices,
  SUM(invoice_total - payment_total - credit_total) AS total_due
FROM Invoices
WHERE invoice_total - payment_total - credit_total > 0;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[(16, Decimal('53935.52'))]

In [5]:
%%sql # Query that count and calculate the sum and average of invoices total after 01/2018

SELECT 'After 1/1/2018' AS selection_date,
  COUNT(*) AS number_of_invoices,
  ROUND(AVG(invoice_total), 2) AS avg_invoice_amt,
  SUM(invoice_total) AS total_invoice_amt
FROM Invoices
WHERE invoice_date > '2018-01-01';

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('After 1/1/2018', 119, Decimal('1984.92'), Decimal('236205.61'))]

In [6]:
%%sql # Query that determine the min and max of the invoice total after 

SELECT "After 1/1/2018" AS selection_date,
  COUNT(*) AS number_of_invoices,
  MAX(invoice_total) AS highest_invoice_total,
  MIN(invoice_total) AS lowest_invoice_total
FROM Invoices
WHERE invoice_date > '2018-01-01';

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('After 1/1/2018', 119, Decimal('37966.19'), Decimal('6.00'))]

In [7]:
%%sql # Select the first and last vendors with min and max

SELECT MIN(vendor_name) AS first_vendor,
  MAX(vendor_name) AS last_vendor,
  COUNT(vendor_name) AS number_of_vendors
FROM Vendors;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('Abbey Office Furnishings', 'Zylka Design', 122)]

In [8]:
%%sql # Use of DISTINCT keyword 

SELECT COUNT(DISTINCT vendor_id) AS number_of_vendors,
  COUNT(vendor_id) AS number_of_invoices,
  ROUND(AVG(invoice_total), 2) AS avg_invoice_amt,
  SUM(invoice_total) AS total_invoicie_amt
FROM Invoices
WHERE invoice_date > '2018-01-01';

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[(34, 119, Decimal('1984.92'), Decimal('236205.61'))]

#### 2- Group and summarize data

In [16]:
%%sql # Calculate the avg invoice amount by vendor

SELECT vendor_id, ROUND(AVG(invoice_total), 2) AS avg_invoice_amt
FROM Invoices
GROUP BY vendor_id
HAVING AVG(invoice_total) > 2000
ORDER BY avg_invoice_amt DESC;

 * mysql+pymysql://w-alkao:***@localhost
9 rows affected.

[(110, Decimal('23978.48')),
 (72, Decimal('10963.66')),
 (104, Decimal('7125.34')),
 (99, Decimal('6940.25')),
 (119, Decimal('4901.26')),
 (97, Decimal('3133.57')),
 (122, Decimal('2575.33')),
 (86, Decimal('2433.00')),
 (100, Decimal('2184.50'))]

In [19]:
%%sql # Calculate the avg invoice total by vendor name

SELECT vendor_name, vendor_state, ROUND(AVG(invoice_total), 2) AS avg_invoice_amt
FROM Vendors JOIN Invoices
  ON Vendors.vendor_id = Invoices.vendor_id
GROUP BY vendor_name
HAVING AVG(invoice_total) > 2000
ORDER BY avg_invoice_amt DESC;

 * mysql+pymysql://w-alkao:***@localhost
9 rows affected.

[('Malloy Lithographing Inc', 'MI', Decimal('23978.48')),
 ('Data Reproductions Corp', 'MI', Decimal('10963.66')),
 ('Digital Dreamworks', 'CA', Decimal('7125.34')),
 ('Bertelsmann Industry Svcs. Inc', 'CA', Decimal('6940.25')),
 ('Yesmed, Inc', 'CA', Decimal('4901.26')),
 ('Compuserve', 'OH', Decimal('3133.57')),
 ('United Parcel Service', 'NV', Decimal('2575.33')),
 ('Computerworld', 'CA', Decimal('2433.00')),
 ('Cahners Publishing Company', 'NV', Decimal('2184.50'))]

In [21]:
%%sql # count the number of invoices by vendor

SELECT vendor_id, COUNT(*) AS invoice_qty
FROM Invoices
GROUP BY vendor_id
ORDER BY invoice_qty;

 * mysql+pymysql://w-alkao:***@localhost
34 rows affected.

[(119, 1),
 (113, 1),
 (114, 1),
 (108, 1),
 (107, 1),
 (106, 1),
 (105, 1),
 (104, 1),
 (103, 1),
 (102, 1),
 (100, 1),
 (99, 1),
 (117, 1),
 (96, 1),
 (94, 1),
 (90, 1),
 (89, 1),
 (88, 1),
 (86, 1),
 (82, 1),
 (81, 1),
 (48, 1),
 (83, 2),
 (80, 2),
 (72, 2),
 (34, 2),
 (37, 3),
 (115, 4),
 (110, 5),
 (95, 6),
 (97, 7),
 (121, 8),
 (122, 9),
 (123, 47)]

In [5]:
%%sql # Calculate the number of invoices and the average invoice amount for the vendors in each state and city

SELECT vendor_state, vendor_city, COUNT(*) AS invoice_qty,
  ROUND(AVG(invoice_total), 2) AS invoice_avg
FROM Invoices JOIN Vendors
  ON Invoices.vendor_id = Vendors.vendor_id
GROUP BY vendor_state, vendor_city
ORDER BY vendor_state, vendor_city;

 * mysql+pymysql://w-alkao:***@localhost
20 rows affected.

[('AZ', 'Phoenix', 1, Decimal('662.00')),
 ('CA', 'Fresno', 19, Decimal('1208.75')),
 ('CA', 'Los Angeles', 1, Decimal('503.20')),
 ('CA', 'Oxnard', 3, Decimal('188.00')),
 ('CA', 'Pasadena', 5, Decimal('196.12')),
 ('CA', 'Sacramento', 7, Decimal('253.00')),
 ('CA', 'San Francisco', 3, Decimal('1211.04')),
 ('CA', 'Turlock', 1, Decimal('95.00')),
 ('CA', 'Valencia', 1, Decimal('6940.25')),
 ('DC', 'Washington', 1, Decimal('600.00')),
 ('MA', 'Boston', 1, Decimal('1367.50')),
 ('MI', 'Ann Arbor', 5, Decimal('23978.48')),
 ('MI', 'Auburn Hills', 2, Decimal('10963.66')),
 ('NV', 'Reno', 9, Decimal('2575.33')),
 ('NV', 'The Lake', 1, Decimal('2184.50')),
 ('OH', 'Cleves', 1, Decimal('207.78')),
 ('OH', 'Columbus', 7, Decimal('3133.57')),
 ('PA', 'Philadelphia', 2, Decimal('132.68')),
 ('TN', 'Memphis', 47, Decimal('93.15')),
 ('TX', 'Dallas', 2, Decimal('1077.21'))]

In [10]:
%%sql # Same query but now limit the groups to those with two or more invoices

SELECT vendor_state, vendor_city, COUNT(*) AS invoice_qty,
  ROUND(AVG(invoice_total), 2) AS invoice_avg
FROM Invoices I JOIN Vendors V
  ON I.vendor_id = V.vendor_id
GROUP BY vendor_state, vendor_city
HAVING COUNT(*) >= 2
ORDER BY vendor_state, vendor_city;

 * mysql+pymysql://w-alkao:***@localhost
12 rows affected.

[('CA', 'Fresno', 19, Decimal('1208.75')),
 ('CA', 'Oxnard', 3, Decimal('188.00')),
 ('CA', 'Pasadena', 5, Decimal('196.12')),
 ('CA', 'Sacramento', 7, Decimal('253.00')),
 ('CA', 'San Francisco', 3, Decimal('1211.04')),
 ('MI', 'Ann Arbor', 5, Decimal('23978.48')),
 ('MI', 'Auburn Hills', 2, Decimal('10963.66')),
 ('NV', 'Reno', 9, Decimal('2575.33')),
 ('OH', 'Columbus', 7, Decimal('3133.57')),
 ('PA', 'Philadelphia', 2, Decimal('132.68')),
 ('TN', 'Memphis', 47, Decimal('93.15')),
 ('TX', 'Dallas', 2, Decimal('1077.21'))]